---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.GroupFailures.GroupPropagationFailedUngroup
source: html/b5599dfb-1d5d-3b98-2ca1-b1747ea58ded.htm
---
# Autodesk.Revit.DB.BuiltInFailures.GroupFailures.GroupPropagationFailedUngroup Property

Can't make change to Group "[Type Name]" with more than one instance. To resolve: Ungroup and Group again under a new name.
 Edit and make change, then change all instances of the original Group to the new Group.

## Syntax (C#)
```csharp
public static FailureDefinitionId GroupPropagationFailedUngroup { get; }
```